Repository: thomashackl/typo3-importstudip
Catalog: Resources/Private/Language/*.locallang.xlf
Languages: de

# tx_importstudip.plugintitle
source: Stud.IP data
de: Daten aus Stud.IP

# tx_importstudip_plugindesc
source: Includes data from Stud.IP, like course or person lists.
de: Fügt Daten aus Stud.IP ein, wie Veranstaltungs- oder Personenverzeichnisse.

# tx_importstudip.backend.sheet.datasheet
source: Show Stud.IP content
de: Inhalte aus Stud.IP anzeigen

# tx_importstudip.backend.label.externtype
source: What type of content do you want to show?
de: Welche Art Inhalt möchten Sie anzeigen?

# tx_importstudip.backend.externtype.courses
source: List of courses
de: Liste von Veranstaltungen

# tx_importstudip.backend.externtype.coursedetails
source: Single course
de: Einzelne Veranstaltung

# tx_importstudip.backend.externtype.persons
source: List of persons
de: Liste von Personen

# tx_importstudip.backend.externtype.persondetails
source: Single person
de: Einzelne Person

# tx_importstudip.backend.externtype.news
source: News
de: Ankündigungen

# tx_importstudip.backend.externtype.download
source: Download area
de: Downloadbereich

# tx_importstudip.backend.sheet.searchsheet
source: Search form
de: Suchformular

# tx_importstudip.conf.debug
source: Debug output?
de: Debug-Ausgaben?

# tx_importstudip.conf.studip_api_path
source: Relative path to REST API
de: Relativer Pfad zur REST API

# tx_importstudip.conf.studip_url
source: Stud.IP URL
de: Adresse der Stud.IP-Installation
